## Final Project Submission

Please fill out: 
* Student name:Justin Maffucci
* Student pace: full time
* Scheduled project review date/time: 
* Instructor name: James Irving
* Blog post URL:

In [1]:
# Your code here - remember to use markdown cells for comments as well!

In [2]:
import os, glob
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

folder = "/Users/justinmaffucci/Desktop/FlatironSchool/Phase1/Project/dsc-phase-1-project/zippedData/"

In [3]:
files = glob.glob(f"{folder}*.csv*")
## Source: James Irving

In [4]:
(f"{folder}*.csv*")
### Source: James Irving

'/Users/justinmaffucci/Desktop/FlatironSchool/Phase1/Project/dsc-phase-1-project/zippedData/*.csv*'

In [5]:
files[0].replace(".csv.gz", '').split('/')[-1].replace('.','_')
### Source: James Irving

'imdb_title_crew'

In [6]:
tables = {}
dashes = '---'*25

for file in files:
    table_name = file.replace(".csv.gz", '').split('/')[-1].replace('.','_')
    print(dashes)
    
    print(f"Preview of {table_name}")
    tables[table_name] = pd.read_csv(file)
    display(tables[table_name].head(5))
    print()
    
### Source: James Irving

---------------------------------------------------------------------------
Preview of imdb_title_crew

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

---------------------------------------------------------------------------
Preview of tmdb_movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

---------------------------------------------------------------------------
Preview of imdb_title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

---------------------------------------------------------------------------
Preview of imdb_title_ratings

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

---------------------------------------------------------------------------
Preview of imdb_name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

---------------------------------------------------------------------------
Preview of imdb_title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

---------------------------------------------------------------------------
Preview of tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

---------------------------------------------------------------------------
Preview of bom_movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

---------------------------------------------------------------------------
Preview of imdb_title_principals

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [7]:
### Merge imdb_title_basics with imdb_title_ratings

titles_and_ratings = pd.merge(tables['imdb_title_basics'], 
                                                 tables['imdb_title_ratings'])

### Merge bom_movie_gross with tn_movie_budgets 

financials = pd.merge(tables['bom_movie_gross'], tables['tn_movie_budgets'], 
                                          left_on='title', right_on='movie')

In [8]:
financials.drop(['domestic_gross_x', 'foreign_gross', 'domestic_gross_y', 'release_date', 'id', 'studio', 'movie'], 
                                                        axis=1, inplace=True)
del titles_and_ratings['original_title']

In [9]:
df = pd.merge(financials, titles_and_ratings, left_on='title', right_on='primary_title')

In [10]:
df.drop_duplicates(subset=['title'], inplace=True)
df.drop(['start_year', 'tconst', 'primary_title'], axis=1, inplace=True)

In [11]:
df.dropna(axis=0, subset=['genres', 'runtime_minutes'], inplace=True)

In [12]:
display(df.info())
df.head(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1147 entries, 0 to 1412
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title              1147 non-null   object
 1   year               1147 non-null   int64
 2   production_budget  1147 non-null   object
 3   worldwide_gross    1147 non-null   object
 4   runtime_minutes    1147 non-null   float64
 5   genres             1147 non-null   object
 6   averagerating      1147 non-null   float64
 7   numvotes           1147 non-null   int64
dtypes: float64(2), int64(2), object(4)
memory usage: 80.6+ KB

None

,title,year,production_budget,worldwide_gross,runtime_minutes,genres,averagerating,numvotes
0,Toy Story 3,2010,"$200,000,000","$1,068,879,522",103.0,"Adventure,Animation,Comedy",8.3,682218
1,Inception,2010,"$160,000,000","$835,524,642",148.0,"Action,Adventure,Sci-Fi",8.8,1841066

In [13]:
## Remove commas from financial metric columns

df['production_budget'].replace(',','', regex=True, inplace=True)
df['worldwide_gross'].replace(',','', regex=True, inplace=True)

## Remove dollar signs from financial metric columns

df['production_budget'] = df['production_budget'].str.replace('$','')
df['worldwide_gross'] = df['worldwide_gross'].str.replace('$','')

## Change data type to integer for financial columns

df['production_budget'] = df['production_budget'].astype(int)
df['worldwide_gross'] = df['worldwide_gross'].astype(int)

In [14]:
df['Profit'] = (df['worldwide_gross'] - df['production_budget'])
df['ROI'] = (df['Profit'] / df['production_budget'])

In [15]:
df = df[['title', 'year', 'worldwide_gross', 'production_budget','Profit',
         'ROI', 'runtime_minutes', 'genres', 'averagerating','numvotes']]

In [16]:
df = df.loc[df['production_budget'] > 10000000]
df

,title,year,worldwide_gross,production_budget,Profit,ROI,runtime_minutes,genres,averagerating,numvotes
0,Toy Story 3,2010,1068879522,200000000,868879522,4.344398,103.0,"Adventure,Animation,Comedy",8.3,682218
1,Inception,2010,835524642,160000000,675524642,4.222029,148.0,"Action,Adventure,Sci-Fi",8.8,1841066
2,Shrek Forever After,2010,756244673,165000000,591244673,3.583301,93.0,"Adventure,Animation,Comedy",6.3,167532
3,The Twilight Saga: Eclipse,2010,706102828,68000000,638102828,9.383865,124.0,"Adventure,Drama,Fantasy",5.0,211733
4,Iron Man 2,2010,621156389,170000000,451156389,2.653861,124.0,"Action,Adventure,Sci-Fi",7.0,657690
...,...,...,...,...,...,...,...,...,...,...
1401,Hotel Artemis,2018,12758799,15000000,-2241201,-0.149413,94.0,"Action,Drama,Sci-Fi",6.1,30586
1402,Kin,2018,10096821,30000000,-19903179,-0.663439,45.0,"Drama,Music",8.6,46
1405,Suspiria,2018,7034615,20000000,-12965385,-0.648269,152.0,"Fantasy,Horror,Mystery",6.8,37360
1406,The Hurricane Heist,2018,30963684,40000000,-9036316,-0.225908,103.0,"Action,Adventure,Crime",5.1,15326
1409,Bilal: A New Breed of Hero,2018,648599,30000000,-29351401,-0.978380,105.0,"Action,Adventure,Animation",8.0,16854

In [17]:
df.columns = ['Title', 'Release Year', 'Worldwide Gross', 'Budget', 'Profit',
              'ROI', 'Runtime', 'Genres', 'Avg. Rating', '# of Ratings']